# DSelectAll

## Description
Procedure DSelectAll deselects all selected visible objects on the active layer of a VectorWorks document. If Layer Options is set to Show-Snap-Modify Others, then DSelectAll will deselect all selected visible objects within the document.

```pascal
PROCEDURE DSelectAll;
```

```python
def vs.DSelectAll():
    return None
```

## Version
Availability: from All Versions

## Category
* Selection